app/Controllers/Admin/Client.php

    public function view($id = "")
    {
        if ($this->checkSession('A') != '') {
            $uri = service('uri');
            $id = $uri->getSegment(4);
            if ($id != '') {
                $condition = array('id' => $id, 'is_deleted' => '0');
                $this->data['clientDetails'] = $this->LmsModel->get_all_details(CLIENT_DETAILS, $condition)->getRow();
---
SELECT *
FROM `client_details`
WHERE `id` = '1'
AND `is_deleted` = '0'
ORDER BY `id` DESC