app/Controllers/Admin/Employee.php

UPDATE `employee_details` SET `first_name` = 'jana', `last_name` = 'j', `dob` = '2023-08-08', `phone` = '3625147859', `email` = 'jana@gmail.com', `address` = 'chennai', `pin_code` = '25478', `city` = 'chennai', `state` = 'tn', `blood_grp` = 'ab', `aadhar_no` = '85478996545', `pan_no` = '63254178', `relationship` = 'father', `r_name` = 'aaaa', `r_phone` = '3456789087', `r_email` = 'aaa@gmail.com', `r_address` = 'chennasi', `work_exp` = 'experience', `status` = '1', `notes` = 'test2', `is_deleted` = '0', `password` = '$2y$10$tUrchXO6wjqlqtI.HFIZJ.anEvD559Zxd83eXBPw2PSWzxyX0ugCu'
WHERE `id` = '2'
---
                        $returnArr['response'] = 'success';

                        $condition = array('id' => $id);
                        $this->LmsModel->update_details(EMPLOYEE_DETAILS, $dataArr, $condition);