app/Controllers/Manager/Manager_setup.php

                }

                $cond5 = ['id' => $details->interview_status_id, 'is_deleted' => '0'];
                $int_sts_details = $this->AdminModel->get_all_details(INTERVIEW_STATUS, $cond5)->getRow();
---
SELECT *
FROM `interview_status`
WHERE `id` = '1'
AND `is_deleted` = '0'
ORDER BY `id` DESC